evidence/scalability/k6_gold_500users.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtests/k6/tsunami.js
        output: -

     scenarios: (100.00%) 1 scenario, 600 max VUs, 6m30s max duration (incl. graceful stop):
              * default: Up to 600 looping VUs for 6m0s over 6 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (0m25.0s), 001/600 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 001/600 VUs  0m00.0s/6m00.0s

running (0m26.0s), 004/600 VUs, 15 complete and 0 interrupted iterations
default   [   0% ] 004/600 VUs  0m01.0s/6m00.0s

running (0m27.0s), 007/600 VUs, 57 complete and 0 interrupted iterations
default   [   1% ] 007/600 VUs  0m02.0s/6m00.0s

running (0m28.0s), 011/600 VUs, 101 complete and 0 interrupted iterations
default   [   1% ] 011/600 VUs  0m03.0s/6m00.0s

running (0m29.0s), 014/600 VUs, 176 complete and 0 interrupted iterations
default   [   1% ] 014/600 VUs  0m04.0s/6m00.0s

running (0m30.0s), 017/600 VUs, 277 complete and 0 interrupted iterations
default   [   1% ] 017/600 VUs  0m05.0s/6m00.0s

running (0m31.0s), 020/600 VUs, 382 complete and 0 interrupted iterations
default   [   2% ] 020/600 VUs  0m06.0s/6m00.0s

running (0m32.0s), 024/600 VUs, 509 complete and 0 interrupted iterations
default   [   2% ] 024/600 VUs  0m07.0s/6m00.0s

running (0m33.0s), 027/600 VUs, 624 complete and 0 interrupted iterations
default   [   2% ] 027/600 VUs  0m08.0s/6m00.0s

running (0m34.0s), 030/600 VUs, 705 complete and 0 interrupted iterations
default   [   3% ] 030/600 VUs  0m09.0s/6m00.0s

running (0m35.0s), 034/600 VUs, 825 complete and 0 interrupted iterations
default   [   3% ] 034/600 VUs  0m10.0s/6m00.0s

running (0m36.0s), 037/600 VUs, 978 complete and 0 interrupted iterations
default   [   3% ] 037/600 VUs  0m11.0s/6m00.0s

running (0m37.0s), 040/600 VUs, 1127 complete and 0 interrupted iterations
default   [   3% ] 040/600 VUs  0m12.0s/6m00.0s

running (0m38.0s), 044/600 VUs, 1263 complete and 0 interrupted iterations
default   [   4% ] 044/600 VUs  0m13.0s/6m00.0s

running (0m39.0s), 047/600 VUs, 1395 complete and 0 interrupted iterations
default   [   4% ] 047/600 VUs  0m14.0s/6m00.0s

running (0m40.0s), 050/600 VUs, 1481 complete and 0 interrupted iterations
default   [   4% ] 050/600 VUs  0m15.0s/6m00.0s

running (0m41.0s), 053/600 VUs, 1543 complete and 0 interrupted iterations
default   [   4% ] 053/600 VUs  0m16.0s/6m00.0s

running (0m42.0s), 057/600 VUs, 1636 complete and 0 interrupted iterations
default   [   5% ] 057/600 VUs  0m17.0s/6m00.0s

running (0m43.0s), 060/600 VUs, 1701 complete and 0 interrupted iterations
default   [   5% ] 060/600 VUs  0m18.0s/6m00.0s

running (0m44.0s), 063/600 VUs, 1771 complete and 0 interrupted iterations
default   [   5% ] 063/600 VUs  0m19.0s/6m00.0s

running (0m45.0s), 067/600 VUs, 1866 complete and 0 interrupted iterations
default   [   6% ] 067/600 VUs  0m20.0s/6m00.0s

running (0m46.0s), 070/600 VUs, 1967 complete and 0 interrupted iterations
default   [   6% ] 070/600 VUs  0m21.0s/6m00.0s

running (0m47.0s), 073/600 VUs, 2088 complete and 0 interrupted iterations
default   [   6% ] 073/600 VUs  0m22.0s/6m00.0s

running (0m48.0s), 077/600 VUs, 2270 complete and 0 interrupted iterations
default   [   6% ] 077/600 VUs  0m23.0s/6m00.0s

running (0m49.0s), 080/600 VUs, 2455 complete and 0 interrupted iterations
default   [   7% ] 080/600 VUs  0m24.0s/6m00.0s

running (0m50.0s), 083/600 VUs, 2577 complete and 0 interrupted iterations
default   [   7% ] 083/600 VUs  0m25.0s/6m00.0s

running (0m51.0s), 086/600 VUs, 2714 complete and 0 interrupted iterations
default   [   7% ] 086/600 VUs  0m26.0s/6m00.0s

running (0m52.0s), 090/600 VUs, 2886 complete and 0 interrupted iterations
default   [   8% ] 090/600 VUs  0m27.0s/6m00.0s

running (0m53.0s), 093/600 VUs, 3048 complete and 0 interrupted iterations
default   [   8% ] 093/600 VUs  0m28.0s/6m00.0s

running (0m54.0s), 096/600 VUs, 3206 complete and 0 interrupted iterations
default   [   8% ] 096/600 VUs  0m29.0s/6m00.0s

running (0m55.0s), 100/600 VUs, 3366 complete and 0 interrupted iterations
default   [   8% ] 100/600 VUs  0m30.0s/6m00.0s

running (0m56.0s), 105/600 VUs, 3516 complete and 0 interrupted iterations
default   [   9% ] 105/600 VUs  0m31.0s/6m00.0s

running (0m57.0s), 110/600 VUs, 3662 complete and 0 interrupted iterations
default   [   9% ] 110/600 VUs  0m32.0s/6m00.0s

running (0m58.0s), 115/600 VUs, 3817 complete and 0 interrupted iterations
default   [   9% ] 115/600 VUs  0m33.0s/6m00.0s

running (0m59.0s), 120/600 VUs, 3981 complete and 0 interrupted iterations
default   [   9% ] 120/600 VUs  0m34.0s/6m00.0s

running (1m00.0s), 125/600 VUs, 4165 complete and 0 interrupted iterations
default   [  10% ] 125/600 VUs  0m35.0s/6m00.0s

running (1m01.0s), 130/600 VUs, 4301 complete and 0 interrupted iterations
default   [  10% ] 130/600 VUs  0m36.0s/6m00.0s

running (1m02.0s), 135/600 VUs, 4432 complete and 0 interrupted iterations
default   [  10% ] 135/600 VUs  0m37.0s/6m00.0s

running (1m03.0s), 140/600 VUs, 4595 complete and 0 interrupted iterations
default   [  11% ] 140/600 VUs  0m38.0s/6m00.0s

running (1m04.0s), 145/600 VUs, 4741 complete and 0 interrupted iterations
default   [  11% ] 145/600 VUs  0m39.0s/6m00.0s

running (1m05.0s), 149/600 VUs, 4882 complete and 0 interrupted iterations
default   [  11% ] 149/600 VUs  0m40.0s/6m00.0s

running (1m06.0s), 155/600 VUs, 5029 complete and 0 interrupted iterations
default   [  11% ] 155/600 VUs  0m41.0s/6m00.0s

running (1m07.0s), 160/600 VUs, 5169 complete and 0 interrupted iterations
default   [  12% ] 160/600 VUs  0m42.0s/6m00.0s

running (1m08.0s), 165/600 VUs, 5283 complete and 0 interrupted iterations
default   [  12% ] 165/600 VUs  0m43.0s/6m00.0s

running (1m09.0s), 170/600 VUs, 5443 complete and 0 interrupted iterations
default   [  12% ] 170/600 VUs  0m44.0s/6m00.0s

running (1m10.0s), 175/600 VUs, 5610 complete and 0 interrupted iterations
default   [  13% ] 175/600 VUs  0m45.0s/6m00.0s

running (1m11.0s), 180/600 VUs, 5786 complete and 0 interrupted iterations
default   [  13% ] 180/600 VUs  0m46.0s/6m00.0s

running (1m12.0s), 185/600 VUs, 5950 complete and 0 interrupted iterations
default   [  13% ] 185/600 VUs  0m47.0s/6m00.0s

running (1m13.0s), 190/600 VUs, 6079 complete and 0 interrupted iterations
default   [  13% ] 190/600 VUs  0m48.0s/6m00.0s

running (1m14.0s), 195/600 VUs, 6248 complete and 0 interrupted iterations
default   [  14% ] 195/600 VUs  0m49.0s/6m00.0s

running (1m15.0s), 200/600 VUs, 6414 complete and 0 interrupted iterations
default   [  14% ] 200/600 VUs  0m50.0s/6m00.0s

running (1m16.0s), 205/600 VUs, 6551 complete and 0 interrupted iterations
default   [  14% ] 205/600 VUs  0m51.0s/6m00.0s

running (1m17.0s), 210/600 VUs, 6654 complete and 0 interrupted iterations
default   [  14% ] 210/600 VUs  0m52.0s/6m00.0s

running (1m18.0s), 215/600 VUs, 6791 complete and 0 interrupted iterations
default   [  15% ] 215/600 VUs  0m53.0s/6m00.0s

running (1m19.0s), 220/600 VUs, 6906 complete and 0 interrupted iterations
default   [  15% ] 220/600 VUs  0m54.0s/6m00.0s

running (1m20.0s), 225/600 VUs, 7071 complete and 0 interrupted iterations
default   [  15% ] 225/600 VUs  0m55.0s/6m00.0s

running (1m21.0s), 230/600 VUs, 7222 complete and 0 interrupted iterations
default   [  16% ] 230/600 VUs  0m56.0s/6m00.0s

running (1m22.0s), 235/600 VUs, 7412 complete and 0 interrupted iterations
default   [  16% ] 235/600 VUs  0m57.0s/6m00.0s

running (1m23.0s), 240/600 VUs, 7579 complete and 0 interrupted iterations
default   [  16% ] 240/600 VUs  0m58.0s/6m00.0s

running (1m24.0s), 245/600 VUs, 7744 complete and 0 interrupted iterations
default   [  16% ] 245/600 VUs  0m59.0s/6m00.0s

running (1m25.0s), 250/600 VUs, 7892 complete and 0 interrupted iterations
default   [  17% ] 250/600 VUs  1m00.0s/6m00.0s

running (1m26.0s), 258/600 VUs, 8066 complete and 0 interrupted iterations
default   [  17% ] 258/600 VUs  1m01.0s/6m00.0s

running (1m27.0s), 266/600 VUs, 8231 complete and 0 interrupted iterations
default   [  17% ] 266/600 VUs  1m02.0s/6m00.0s

running (1m28.0s), 275/600 VUs, 8408 complete and 0 interrupted iterations
default   [  18% ] 275/600 VUs  1m03.0s/6m00.0s

running (1m29.0s), 283/600 VUs, 8568 complete and 0 interrupted iterations
default   [  18% ] 283/600 VUs  1m04.0s/6m00.0s

running (1m30.0s), 291/600 VUs, 8696 complete and 0 interrupted iterations
default   [  18% ] 291/600 VUs  1m05.0s/6m00.0s

running (1m31.0s), 300/600 VUs, 8849 complete and 0 interrupted iterations
default   [  18% ] 300/600 VUs  1m06.0s/6m00.0s

running (1m32.0s), 308/600 VUs, 9019 complete and 0 interrupted iterations
default   [  19% ] 308/600 VUs  1m07.0s/6m00.0s

running (1m33.0s), 316/600 VUs, 9180 complete and 0 interrupted iterations
default   [  19% ] 316/600 VUs  1m08.0s/6m00.0s

running (1m34.0s), 325/600 VUs, 9321 complete and 0 interrupted iterations
default   [  19% ] 325/600 VUs  1m09.0s/6m00.0s

running (1m35.0s), 333/600 VUs, 9447 complete and 0 interrupted iterations
default   [  19% ] 333/600 VUs  1m10.0s/6m00.0s

running (1m36.0s), 341/600 VUs, 9597 complete and 0 interrupted iterations
default   [  20% ] 341/600 VUs  1m11.0s/6m00.0s

running (1m37.0s), 350/600 VUs, 9772 complete and 0 interrupted iterations
default   [  20% ] 350/600 VUs  1m12.0s/6m00.0s

running (1m38.0s), 358/600 VUs, 9911 complete and 0 interrupted iterations
default   [  20% ] 358/600 VUs  1m13.0s/6m00.0s

running (1m39.0s), 366/600 VUs, 10073 complete and 0 interrupted iterations
default   [  21% ] 366/600 VUs  1m14.0s/6m00.0s

running (1m40.0s), 375/600 VUs, 10192 complete and 0 interrupted iterations
default   [  21% ] 375/600 VUs  1m15.0s/6m00.0s

running (1m41.0s), 383/600 VUs, 10311 complete and 0 interrupted iterations
default   [  21% ] 383/600 VUs  1m16.0s/6m00.0s

running (1m42.0s), 391/600 VUs, 10420 complete and 0 interrupted iterations
default   [  21% ] 391/600 VUs  1m17.0s/6m00.0s

running (1m43.0s), 400/600 VUs, 10523 complete and 0 interrupted iterations
default   [  22% ] 400/600 VUs  1m18.0s/6m00.0s

running (1m44.0s), 408/600 VUs, 10584 complete and 0 interrupted iterations
default   [  22% ] 408/600 VUs  1m19.0s/6m00.0s

running (1m45.0s), 416/600 VUs, 10656 complete and 0 interrupted iterations
default   [  22% ] 416/600 VUs  1m20.0s/6m00.0s

running (1m46.0s), 425/600 VUs, 10749 complete and 0 interrupted iterations
default   [  23% ] 425/600 VUs  1m21.0s/6m00.0s

running (1m47.0s), 433/600 VUs, 10841 complete and 0 interrupted iterations
default   [  23% ] 433/600 VUs  1m22.0s/6m00.0s

running (1m48.0s), 441/600 VUs, 10934 complete and 0 interrupted iterations
default   [  23% ] 441/600 VUs  1m23.0s/6m00.0s

running (1m49.0s), 450/600 VUs, 11082 complete and 0 interrupted iterations
default   [  23% ] 450/600 VUs  1m24.0s/6m00.0s

running (1m50.0s), 458/600 VUs, 11237 complete and 0 interrupted iterations
default   [  24% ] 458/600 VUs  1m25.0s/6m00.0s

running (1m51.0s), 466/600 VUs, 11359 complete and 0 interrupted iterations
default   [  24% ] 466/600 VUs  1m26.0s/6m00.0s

running (1m52.0s), 475/600 VUs, 11492 complete and 0 interrupted iterations
default   [  24% ] 475/600 VUs  1m27.0s/6m00.0s

running (1m53.0s), 483/600 VUs, 11623 complete and 0 interrupted iterations
default   [  24% ] 483/600 VUs  1m28.0s/6m00.0s

running (1m54.0s), 491/600 VUs, 11755 complete and 0 interrupted iterations
default   [  25% ] 491/600 VUs  1m29.0s/6m00.0s

running (1m55.0s), 500/600 VUs, 11947 complete and 0 interrupted iterations
default   [  25% ] 500/600 VUs  1m30.0s/6m00.0s

running (1m56.0s), 500/600 VUs, 12137 complete and 0 interrupted iterations
default   [  25% ] 500/600 VUs  1m31.0s/6m00.0s

running (1m57.0s), 500/600 VUs, 12279 complete and 0 interrupted iterations
default   [  26% ] 500/600 VUs  1m32.0s/6m00.0s

running (1m58.0s), 500/600 VUs, 12438 complete and 0 interrupted iterations
default   [  26% ] 500/600 VUs  1m33.0s/6m00.0s

running (1m59.0s), 500/600 VUs, 12611 complete and 0 interrupted iterations
default   [  26% ] 500/600 VUs  1m34.0s/6m00.0s

running (2m00.0s), 500/600 VUs, 12755 complete and 0 interrupted iterations
default   [  26% ] 500/600 VUs  1m35.0s/6m00.0s

running (2m01.0s), 500/600 VUs, 12937 complete and 0 interrupted iterations
default   [  27% ] 500/600 VUs  1m36.0s/6m00.0s

running (2m02.0s), 500/600 VUs, 13117 complete and 0 interrupted iterations
default   [  27% ] 500/600 VUs  1m37.0s/6m00.0s

running (2m03.0s), 500/600 VUs, 13285 complete and 0 interrupted iterations
default   [  27% ] 500/600 VUs  1m38.0s/6m00.0s

running (2m04.0s), 500/600 VUs, 13469 complete and 0 interrupted iterations
default   [  28% ] 500/600 VUs  1m39.0s/6m00.0s

running (2m05.0s), 500/600 VUs, 13634 complete and 0 interrupted iterations
default   [  28% ] 500/600 VUs  1m40.0s/6m00.0s

running (2m06.0s), 500/600 VUs, 13781 complete and 0 interrupted iterations
default   [  28% ] 500/600 VUs  1m41.0s/6m00.0s

running (2m07.0s), 500/600 VUs, 13923 complete and 0 interrupted iterations
default   [  28% ] 500/600 VUs  1m42.0s/6m00.0s

running (2m08.0s), 500/600 VUs, 14069 complete and 0 interrupted iterations
default   [  29% ] 500/600 VUs  1m43.0s/6m00.0s

running (2m09.0s), 500/600 VUs, 14242 complete and 0 interrupted iterations
default   [  29% ] 500/600 VUs  1m44.0s/6m00.0s

running (2m10.0s), 500/600 VUs, 14419 complete and 0 interrupted iterations
default   [  29% ] 500/600 VUs  1m45.0s/6m00.0s

running (2m11.0s), 500/600 VUs, 14563 complete and 0 interrupted iterations
default   [  29% ] 500/600 VUs  1m46.0s/6m00.0s

running (2m12.0s), 500/600 VUs, 14730 complete and 0 interrupted iterations
default   [  30% ] 500/600 VUs  1m47.0s/6m00.0s

running (2m13.0s), 500/600 VUs, 14887 complete and 0 interrupted iterations
default   [  30% ] 500/600 VUs  1m48.0s/6m00.0s

running (2m14.0s), 500/600 VUs, 15072 complete and 0 interrupted iterations
default   [  30% ] 500/600 VUs  1m49.0s/6m00.0s

running (2m15.0s), 500/600 VUs, 15241 complete and 0 interrupted iterations
default   [  31% ] 500/600 VUs  1m50.0s/6m00.0s

running (2m16.0s), 500/600 VUs, 15408 complete and 0 interrupted iterations
default   [  31% ] 500/600 VUs  1m51.0s/6m00.0s

running (2m17.0s), 500/600 VUs, 15544 complete and 0 interrupted iterations
default   [  31% ] 500/600 VUs  1m52.0s/6m00.0s

running (2m18.0s), 500/600 VUs, 15700 complete and 0 interrupted iterations
default   [  31% ] 500/600 VUs  1m53.0s/6m00.0s

running (2m19.0s), 500/600 VUs, 15847 complete and 0 interrupted iterations
default   [  32% ] 500/600 VUs  1m54.0s/6m00.0s

running (2m20.0s), 500/600 VUs, 16005 complete and 0 interrupted iterations
default   [  32% ] 500/600 VUs  1m55.0s/6m00.0s

running (2m21.0s), 500/600 VUs, 16164 complete and 0 interrupted iterations
default   [  32% ] 500/600 VUs  1m56.0s/6m00.0s

running (2m22.0s), 500/600 VUs, 16319 complete and 0 interrupted iterations
default   [  33% ] 500/600 VUs  1m57.0s/6m00.0s

running (2m23.0s), 500/600 VUs, 16454 complete and 0 interrupted iterations
default   [  33% ] 500/600 VUs  1m58.0s/6m00.0s

running (2m24.0s), 500/600 VUs, 16620 complete and 0 interrupted iterations
default   [  33% ] 500/600 VUs  1m59.0s/6m00.0s

running (2m25.0s), 500/600 VUs, 16787 complete and 0 interrupted iterations
default   [  33% ] 500/600 VUs  2m00.0s/6m00.0s

running (2m26.0s), 500/600 VUs, 16945 complete and 0 interrupted iterations
default   [  34% ] 500/600 VUs  2m01.0s/6m00.0s

running (2m27.0s), 500/600 VUs, 17074 complete and 0 interrupted iterations
default   [  34% ] 500/600 VUs  2m02.0s/6m00.0s

running (2m28.0s), 500/600 VUs, 17210 complete and 0 interrupted iterations
default   [  34% ] 500/600 VUs  2m03.0s/6m00.0s

running (2m29.0s), 500/600 VUs, 17326 complete and 0 interrupted iterations
default   [  34% ] 500/600 VUs  2m04.0s/6m00.0s

running (2m30.0s), 500/600 VUs, 17479 complete and 0 interrupted iterations
default   [  35% ] 500/600 VUs  2m05.0s/6m00.0s

running (2m31.0s), 500/600 VUs, 17643 complete and 0 interrupted iterations
default   [  35% ] 500/600 VUs  2m06.0s/6m00.0s

running (2m32.0s), 500/600 VUs, 17770 complete and 0 interrupted iterations
default   [  35% ] 500/600 VUs  2m07.0s/6m00.0s

running (2m33.0s), 500/600 VUs, 17933 complete and 0 interrupted iterations
default   [  36% ] 500/600 VUs  2m08.0s/6m00.0s

running (2m34.0s), 500/600 VUs, 18103 complete and 0 interrupted iterations
default   [  36% ] 500/600 VUs  2m09.0s/6m00.0s

running (2m35.0s), 500/600 VUs, 18249 complete and 0 interrupted iterations
default   [  36% ] 500/600 VUs  2m10.0s/6m00.0s

running (2m36.0s), 500/600 VUs, 18347 complete and 0 interrupted iterations
default   [  36% ] 500/600 VUs  2m11.0s/6m00.0s

running (2m37.0s), 500/600 VUs, 18436 complete and 0 interrupted iterations
default   [  37% ] 500/600 VUs  2m12.0s/6m00.0s

running (2m38.0s), 500/600 VUs, 18559 complete and 0 interrupted iterations
default   [  37% ] 500/600 VUs  2m13.0s/6m00.0s

running (2m39.0s), 500/600 VUs, 18708 complete and 0 interrupted iterations
default   [  37% ] 500/600 VUs  2m14.0s/6m00.0s

running (2m40.0s), 500/600 VUs, 18830 complete and 0 interrupted iterations
default   [  38% ] 500/600 VUs  2m15.0s/6m00.0s

running (2m41.0s), 500/600 VUs, 18964 complete and 0 interrupted iterations
default   [  38% ] 500/600 VUs  2m16.0s/6m00.0s

running (2m42.0s), 500/600 VUs, 19086 complete and 0 interrupted iterations
default   [  38% ] 500/600 VUs  2m17.0s/6m00.0s

running (2m43.0s), 500/600 VUs, 19228 complete and 0 interrupted iterations
default   [  38% ] 500/600 VUs  2m18.0s/6m00.0s

running (2m44.0s), 500/600 VUs, 19369 complete and 0 interrupted iterations
default   [  39% ] 500/600 VUs  2m19.0s/6m00.0s

running (2m45.0s), 500/600 VUs, 19514 complete and 0 interrupted iterations
default   [  39% ] 500/600 VUs  2m20.0s/6m00.0s

running (2m46.0s), 500/600 VUs, 19632 complete and 0 interrupted iterations
default   [  39% ] 500/600 VUs  2m21.0s/6m00.0s

running (2m47.0s), 500/600 VUs, 19774 complete and 0 interrupted iterations
default   [  39% ] 500/600 VUs  2m22.0s/6m00.0s

running (2m48.0s), 500/600 VUs, 19938 complete and 0 interrupted iterations
default   [  40% ] 500/600 VUs  2m23.0s/6m00.0s

running (2m49.0s), 500/600 VUs, 20063 complete and 0 interrupted iterations
default   [  40% ] 500/600 VUs  2m24.0s/6m00.0s

running (2m50.0s), 500/600 VUs, 20188 complete and 0 interrupted iterations
default   [  40% ] 500/600 VUs  2m25.0s/6m00.0s

running (2m51.0s), 500/600 VUs, 20309 complete and 0 interrupted iterations
default   [  41% ] 500/600 VUs  2m26.0s/6m00.0s

running (2m52.0s), 500/600 VUs, 20447 complete and 0 interrupted iterations
default   [  41% ] 500/600 VUs  2m27.0s/6m00.0s

running (2m53.0s), 500/600 VUs, 20617 complete and 0 interrupted iterations
default   [  41% ] 500/600 VUs  2m28.0s/6m00.0s

running (2m54.0s), 500/600 VUs, 20796 complete and 0 interrupted iterations
default   [  41% ] 500/600 VUs  2m29.0s/6m00.0s

running (2m55.0s), 500/600 VUs, 20954 complete and 0 interrupted iterations
default   [  42% ] 500/600 VUs  2m30.0s/6m00.0s

running (2m56.0s), 500/600 VUs, 21115 complete and 0 interrupted iterations
default   [  42% ] 500/600 VUs  2m31.0s/6m00.0s

running (2m57.0s), 500/600 VUs, 21255 complete and 0 interrupted iterations
default   [  42% ] 500/600 VUs  2m32.0s/6m00.0s

running (2m58.0s), 500/600 VUs, 21402 complete and 0 interrupted iterations
default   [  43% ] 500/600 VUs  2m33.0s/6m00.0s

running (2m59.0s), 500/600 VUs, 21556 complete and 0 interrupted iterations
default   [  43% ] 500/600 VUs  2m34.0s/6m00.0s

running (3m00.0s), 500/600 VUs, 21722 complete and 0 interrupted iterations
default   [  43% ] 500/600 VUs  2m35.0s/6m00.0s

running (3m01.0s), 500/600 VUs, 21900 complete and 0 interrupted iterations
default   [  43% ] 500/600 VUs  2m36.0s/6m00.0s

running (3m02.0s), 500/600 VUs, 22030 complete and 0 interrupted iterations
default   [  44% ] 500/600 VUs  2m37.0s/6m00.0s

running (3m03.0s), 500/600 VUs, 22140 complete and 0 interrupted iterations
default   [  44% ] 500/600 VUs  2m38.0s/6m00.0s

running (3m04.0s), 500/600 VUs, 22277 complete and 0 interrupted iterations
default   [  44% ] 500/600 VUs  2m39.0s/6m00.0s

running (3m05.0s), 500/600 VUs, 22428 complete and 0 interrupted iterations
default   [  44% ] 500/600 VUs  2m40.0s/6m00.0s

running (3m06.0s), 500/600 VUs, 22595 complete and 0 interrupted iterations
default   [  45% ] 500/600 VUs  2m41.0s/6m00.0s

running (3m07.0s), 500/600 VUs, 22754 complete and 0 interrupted iterations
default   [  45% ] 500/600 VUs  2m42.0s/6m00.0s

running (3m08.0s), 500/600 VUs, 22885 complete and 0 interrupted iterations
default   [  45% ] 500/600 VUs  2m43.0s/6m00.0s

running (3m09.0s), 500/600 VUs, 23007 complete and 0 interrupted iterations
default   [  46% ] 500/600 VUs  2m44.0s/6m00.0s

running (3m10.0s), 500/600 VUs, 23163 complete and 0 interrupted iterations
default   [  46% ] 500/600 VUs  2m45.0s/6m00.0s

running (3m11.0s), 500/600 VUs, 23330 complete and 0 interrupted iterations
default   [  46% ] 500/600 VUs  2m46.0s/6m00.0s

running (3m12.0s), 500/600 VUs, 23493 complete and 0 interrupted iterations
default   [  46% ] 500/600 VUs  2m47.0s/6m00.0s

running (3m13.0s), 500/600 VUs, 23624 complete and 0 interrupted iterations
default   [  47% ] 500/600 VUs  2m48.0s/6m00.0s

running (3m14.0s), 500/600 VUs, 23781 complete and 0 interrupted iterations
default   [  47% ] 500/600 VUs  2m49.0s/6m00.0s

running (3m15.0s), 500/600 VUs, 23915 complete and 0 interrupted iterations
default   [  47% ] 500/600 VUs  2m50.0s/6m00.0s

running (3m16.0s), 500/600 VUs, 24056 complete and 0 interrupted iterations
default   [  48% ] 500/600 VUs  2m51.0s/6m00.0s

running (3m17.0s), 500/600 VUs, 24206 complete and 0 interrupted iterations
default   [  48% ] 500/600 VUs  2m52.0s/6m00.0s

running (3m18.0s), 500/600 VUs, 24354 complete and 0 interrupted iterations
default   [  48% ] 500/600 VUs  2m53.0s/6m00.0s

running (3m19.0s), 500/600 VUs, 24485 complete and 0 interrupted iterations
default   [  48% ] 500/600 VUs  2m54.0s/6m00.0s

running (3m20.0s), 500/600 VUs, 24621 complete and 0 interrupted iterations
default   [  49% ] 500/600 VUs  2m55.0s/6m00.0s

running (3m21.0s), 500/600 VUs, 24745 complete and 0 interrupted iterations
default   [  49% ] 500/600 VUs  2m56.0s/6m00.0s

running (3m22.0s), 500/600 VUs, 24887 complete and 0 interrupted iterations
default   [  49% ] 500/600 VUs  2m57.0s/6m00.0s

running (3m23.0s), 500/600 VUs, 25031 complete and 0 interrupted iterations
default   [  49% ] 500/600 VUs  2m58.0s/6m00.0s

running (3m24.0s), 500/600 VUs, 25161 complete and 0 interrupted iterations
default   [  50% ] 500/600 VUs  2m59.0s/6m00.0s

running (3m25.0s), 500/600 VUs, 25293 complete and 0 interrupted iterations
default   [  50% ] 500/600 VUs  3m00.0s/6m00.0s

running (3m26.0s), 500/600 VUs, 25429 complete and 0 interrupted iterations
default   [  50% ] 500/600 VUs  3m01.0s/6m00.0s

running (3m27.0s), 500/600 VUs, 25564 complete and 0 interrupted iterations
default   [  51% ] 500/600 VUs  3m02.0s/6m00.0s

running (3m28.0s), 500/600 VUs, 25706 complete and 0 interrupted iterations
default   [  51% ] 500/600 VUs  3m03.0s/6m00.0s

running (3m29.0s), 500/600 VUs, 25867 complete and 0 interrupted iterations
default   [  51% ] 500/600 VUs  3m04.0s/6m00.0s

running (3m30.0s), 500/600 VUs, 26007 complete and 0 interrupted iterations
default   [  51% ] 500/600 VUs  3m05.0s/6m00.0s

running (3m31.0s), 500/600 VUs, 26161 complete and 0 interrupted iterations
default   [  52% ] 500/600 VUs  3m06.0s/6m00.0s

running (3m32.0s), 500/600 VUs, 26313 complete and 0 interrupted iterations
default   [  52% ] 500/600 VUs  3m07.0s/6m00.0s

running (3m33.0s), 500/600 VUs, 26450 complete and 0 interrupted iterations
default   [  52% ] 500/600 VUs  3m08.0s/6m00.0s

running (3m34.0s), 500/600 VUs, 26594 complete and 0 interrupted iterations
default   [  53% ] 500/600 VUs  3m09.0s/6m00.0s

running (3m35.0s), 500/600 VUs, 26723 complete and 0 interrupted iterations
default   [  53% ] 500/600 VUs  3m10.0s/6m00.0s

running (3m36.0s), 500/600 VUs, 26871 complete and 0 interrupted iterations
default   [  53% ] 500/600 VUs  3m11.0s/6m00.0s

running (3m37.0s), 500/600 VUs, 27031 complete and 0 interrupted iterations
default   [  53% ] 500/600 VUs  3m12.0s/6m00.0s

running (3m38.0s), 500/600 VUs, 27176 complete and 0 interrupted iterations
default   [  54% ] 500/600 VUs  3m13.0s/6m00.0s

running (3m39.0s), 500/600 VUs, 27286 complete and 0 interrupted iterations
default   [  54% ] 500/600 VUs  3m14.0s/6m00.0s

running (3m40.0s), 500/600 VUs, 27400 complete and 0 interrupted iterations
default   [  54% ] 500/600 VUs  3m15.0s/6m00.0s

running (3m41.0s), 500/600 VUs, 27502 complete and 0 interrupted iterations
default   [  54% ] 500/600 VUs  3m16.0s/6m00.0s

running (3m42.0s), 500/600 VUs, 27616 complete and 0 interrupted iterations
default   [  55% ] 500/600 VUs  3m17.0s/6m00.0s

running (3m43.0s), 500/600 VUs, 27736 complete and 0 interrupted iterations
default   [  55% ] 500/600 VUs  3m18.0s/6m00.0s

running (3m44.0s), 500/600 VUs, 27895 complete and 0 interrupted iterations
default   [  55% ] 500/600 VUs  3m19.0s/6m00.0s

running (3m45.0s), 500/600 VUs, 28055 complete and 0 interrupted iterations
default   [  56% ] 500/600 VUs  3m20.0s/6m00.0s

running (3m46.0s), 500/600 VUs, 28194 complete and 0 interrupted iterations
default   [  56% ] 500/600 VUs  3m21.0s/6m00.0s

running (3m47.0s), 500/600 VUs, 28343 complete and 0 interrupted iterations
default   [  56% ] 500/600 VUs  3m22.0s/6m00.0s

running (3m48.0s), 500/600 VUs, 28497 complete and 0 interrupted iterations
default   [  56% ] 500/600 VUs  3m23.0s/6m00.0s

running (3m49.0s), 500/600 VUs, 28640 complete and 0 interrupted iterations
default   [  57% ] 500/600 VUs  3m24.0s/6m00.0s

running (3m50.0s), 500/600 VUs, 28781 complete and 0 interrupted iterations
default   [  57% ] 500/600 VUs  3m25.0s/6m00.0s

running (3m51.0s), 500/600 VUs, 28914 complete and 0 interrupted iterations
default   [  57% ] 500/600 VUs  3m26.0s/6m00.0s

running (3m52.0s), 500/600 VUs, 29069 complete and 0 interrupted iterations
default   [  58% ] 500/600 VUs  3m27.0s/6m00.0s

running (3m53.0s), 500/600 VUs, 29222 complete and 0 interrupted iterations
default   [  58% ] 500/600 VUs  3m28.0s/6m00.0s

running (3m54.0s), 500/600 VUs, 29390 complete and 0 interrupted iterations
default   [  58% ] 500/600 VUs  3m29.0s/6m00.0s

running (3m55.0s), 500/600 VUs, 29564 complete and 0 interrupted iterations
default   [  58% ] 500/600 VUs  3m30.0s/6m00.0s

running (3m56.0s), 500/600 VUs, 29715 complete and 0 interrupted iterations
default   [  59% ] 500/600 VUs  3m31.0s/6m00.0s

running (3m57.0s), 500/600 VUs, 29868 complete and 0 interrupted iterations
default   [  59% ] 500/600 VUs  3m32.0s/6m00.0s

running (3m58.0s), 500/600 VUs, 30035 complete and 0 interrupted iterations
default   [  59% ] 500/600 VUs  3m33.0s/6m00.0s

running (3m59.0s), 500/600 VUs, 30210 complete and 0 interrupted iterations
default   [  59% ] 500/600 VUs  3m34.0s/6m00.0s

running (4m00.0s), 500/600 VUs, 30378 complete and 0 interrupted iterations
default   [  60% ] 500/600 VUs  3m35.0s/6m00.0s

running (4m01.0s), 500/600 VUs, 30542 complete and 0 interrupted iterations
default   [  60% ] 500/600 VUs  3m36.0s/6m00.0s

running (4m02.0s), 500/600 VUs, 30681 complete and 0 interrupted iterations
default   [  60% ] 500/600 VUs  3m37.0s/6m00.0s

running (4m03.0s), 500/600 VUs, 30852 complete and 0 interrupted iterations
default   [  61% ] 500/600 VUs  3m38.0s/6m00.0s

running (4m04.0s), 500/600 VUs, 31023 complete and 0 interrupted iterations
default   [  61% ] 500/600 VUs  3m39.0s/6m00.0s

running (4m05.0s), 500/600 VUs, 31184 complete and 0 interrupted iterations
default   [  61% ] 500/600 VUs  3m40.0s/6m00.0s

running (4m06.0s), 500/600 VUs, 31355 complete and 0 interrupted iterations
default   [  61% ] 500/600 VUs  3m41.0s/6m00.0s

running (4m07.0s), 500/600 VUs, 31493 complete and 0 interrupted iterations
default   [  62% ] 500/600 VUs  3m42.0s/6m00.0s

running (4m08.0s), 500/600 VUs, 31608 complete and 0 interrupted iterations
default   [  62% ] 500/600 VUs  3m43.0s/6m00.0s

running (4m09.0s), 500/600 VUs, 31760 complete and 0 interrupted iterations
default   [  62% ] 500/600 VUs  3m44.0s/6m00.0s

running (4m10.0s), 500/600 VUs, 31910 complete and 0 interrupted iterations
default   [  63% ] 500/600 VUs  3m45.0s/6m00.0s

running (4m11.0s), 500/600 VUs, 32052 complete and 0 interrupted iterations
default   [  63% ] 500/600 VUs  3m46.0s/6m00.0s

running (4m12.0s), 500/600 VUs, 32234 complete and 0 interrupted iterations
default   [  63% ] 500/600 VUs  3m47.0s/6m00.0s

running (4m13.0s), 500/600 VUs, 32389 complete and 0 interrupted iterations
default   [  63% ] 500/600 VUs  3m48.0s/6m00.0s

running (4m14.0s), 500/600 VUs, 32557 complete and 0 interrupted iterations
default   [  64% ] 500/600 VUs  3m49.0s/6m00.0s

running (4m15.0s), 500/600 VUs, 32727 complete and 0 interrupted iterations
default   [  64% ] 500/600 VUs  3m50.0s/6m00.0s

running (4m16.0s), 500/600 VUs, 32862 complete and 0 interrupted iterations
default   [  64% ] 500/600 VUs  3m51.0s/6m00.0s

running (4m17.0s), 500/600 VUs, 32992 complete and 0 interrupted iterations
default   [  64% ] 500/600 VUs  3m52.0s/6m00.0s

running (4m18.0s), 500/600 VUs, 33130 complete and 0 interrupted iterations
default   [  65% ] 500/600 VUs  3m53.0s/6m00.0s

running (4m19.0s), 500/600 VUs, 33279 complete and 0 interrupted iterations
default   [  65% ] 500/600 VUs  3m54.0s/6m00.0s

running (4m20.0s), 500/600 VUs, 33428 complete and 0 interrupted iterations
default   [  65% ] 500/600 VUs  3m55.0s/6m00.0s

running (4m21.0s), 500/600 VUs, 33585 complete and 0 interrupted iterations
default   [  66% ] 500/600 VUs  3m56.0s/6m00.0s

running (4m22.0s), 500/600 VUs, 33736 complete and 0 interrupted iterations
default   [  66% ] 500/600 VUs  3m57.0s/6m00.0s

running (4m23.0s), 500/600 VUs, 33867 complete and 0 interrupted iterations
default   [  66% ] 500/600 VUs  3m58.0s/6m00.0s

running (4m24.0s), 500/600 VUs, 33991 complete and 0 interrupted iterations
default   [  66% ] 500/600 VUs  3m59.0s/6m00.0s

running (4m25.0s), 500/600 VUs, 34153 complete and 0 interrupted iterations
default   [  67% ] 500/600 VUs  4m00.0s/6m00.0s

running (4m26.0s), 500/600 VUs, 34313 complete and 0 interrupted iterations
default   [  67% ] 500/600 VUs  4m01.0s/6m00.0s

running (4m27.0s), 500/600 VUs, 34438 complete and 0 interrupted iterations
default   [  67% ] 500/600 VUs  4m02.0s/6m00.0s

running (4m28.0s), 500/600 VUs, 34551 complete and 0 interrupted iterations
default   [  68% ] 500/600 VUs  4m03.0s/6m00.0s

running (4m29.0s), 500/600 VUs, 34688 complete and 0 interrupted iterations
default   [  68% ] 500/600 VUs  4m04.0s/6m00.0s

running (4m30.0s), 500/600 VUs, 34855 complete and 0 interrupted iterations
default   [  68% ] 500/600 VUs  4m05.0s/6m00.0s

running (4m31.0s), 500/600 VUs, 35023 complete and 0 interrupted iterations
default   [  68% ] 500/600 VUs  4m06.0s/6m00.0s

running (4m32.0s), 500/600 VUs, 35180 complete and 0 interrupted iterations
default   [  69% ] 500/600 VUs  4m07.0s/6m00.0s

running (4m33.0s), 500/600 VUs, 35327 complete and 0 interrupted iterations
default   [  69% ] 500/600 VUs  4m08.0s/6m00.0s

running (4m34.0s), 500/600 VUs, 35509 complete and 0 interrupted iterations
default   [  69% ] 500/600 VUs  4m09.0s/6m00.0s

running (4m35.0s), 500/600 VUs, 35657 complete and 0 interrupted iterations
default   [  69% ] 500/600 VUs  4m10.0s/6m00.0s

running (4m36.0s), 500/600 VUs, 35810 complete and 0 interrupted iterations
default   [  70% ] 500/600 VUs  4m11.0s/6m00.0s

running (4m37.0s), 500/600 VUs, 35965 complete and 0 interrupted iterations
default   [  70% ] 500/600 VUs  4m12.0s/6m00.0s

running (4m38.0s), 500/600 VUs, 36099 complete and 0 interrupted iterations
default   [  70% ] 500/600 VUs  4m13.0s/6m00.0s

running (4m39.0s), 500/600 VUs, 36201 complete and 0 interrupted iterations
default   [  71% ] 500/600 VUs  4m14.0s/6m00.0s

running (4m40.0s), 500/600 VUs, 36298 complete and 0 interrupted iterations
default   [  71% ] 500/600 VUs  4m15.0s/6m00.0s

running (4m41.0s), 500/600 VUs, 36429 complete and 0 interrupted iterations
default   [  71% ] 500/600 VUs  4m16.0s/6m00.0s

running (4m42.0s), 500/600 VUs, 36562 complete and 0 interrupted iterations
default   [  71% ] 500/600 VUs  4m17.0s/6m00.0s

running (4m43.0s), 500/600 VUs, 36647 complete and 0 interrupted iterations
default   [  72% ] 500/600 VUs  4m18.0s/6m00.0s

running (4m44.0s), 500/600 VUs, 36802 complete and 0 interrupted iterations
default   [  72% ] 500/600 VUs  4m19.0s/6m00.0s

running (4m45.0s), 500/600 VUs, 36961 complete and 0 interrupted iterations
default   [  72% ] 500/600 VUs  4m20.0s/6m00.0s

running (4m46.0s), 500/600 VUs, 37103 complete and 0 interrupted iterations
default   [  73% ] 500/600 VUs  4m21.0s/6m00.0s

running (4m47.0s), 500/600 VUs, 37236 complete and 0 interrupted iterations
default   [  73% ] 500/600 VUs  4m22.0s/6m00.0s

running (4m48.0s), 500/600 VUs, 37364 complete and 0 interrupted iterations
default   [  73% ] 500/600 VUs  4m23.0s/6m00.0s

running (4m49.0s), 500/600 VUs, 37478 complete and 0 interrupted iterations
default   [  73% ] 500/600 VUs  4m24.0s/6m00.0s

running (4m50.0s), 500/600 VUs, 37592 complete and 0 interrupted iterations
default   [  74% ] 500/600 VUs  4m25.0s/6m00.0s

running (4m51.0s), 500/600 VUs, 37702 complete and 0 interrupted iterations
default   [  74% ] 500/600 VUs  4m26.0s/6m00.0s

running (4m52.0s), 500/600 VUs, 37801 complete and 0 interrupted iterations
default   [  74% ] 500/600 VUs  4m27.0s/6m00.0s

running (4m53.0s), 500/600 VUs, 37898 complete and 0 interrupted iterations
default   [  74% ] 500/600 VUs  4m28.0s/6m00.0s

running (4m54.0s), 500/600 VUs, 38007 complete and 0 interrupted iterations
default   [  75% ] 500/600 VUs  4m29.0s/6m00.0s

running (4m55.0s), 500/600 VUs, 38114 complete and 0 interrupted iterations
default   [  75% ] 500/600 VUs  4m30.0s/6m00.0s

running (4m56.0s), 501/600 VUs, 38243 complete and 0 interrupted iterations
default   [  75% ] 501/600 VUs  4m31.0s/6m00.0s

running (4m57.0s), 503/600 VUs, 38361 complete and 0 interrupted iterations
default   [  76% ] 503/600 VUs  4m32.0s/6m00.0s

running (4m58.0s), 505/600 VUs, 38491 complete and 0 interrupted iterations
default   [  76% ] 505/600 VUs  4m33.0s/6m00.0s

running (4m59.0s), 506/600 VUs, 38624 complete and 0 interrupted iterations
default   [  76% ] 506/600 VUs  4m34.0s/6m00.0s

running (5m00.0s), 508/600 VUs, 38788 complete and 0 interrupted iterations
default   [  76% ] 508/600 VUs  4m35.0s/6m00.0s

running (5m01.0s), 510/600 VUs, 38946 complete and 0 interrupted iterations
default   [  77% ] 510/600 VUs  4m36.0s/6m00.0s

running (5m02.0s), 511/600 VUs, 39101 complete and 0 interrupted iterations
default   [  77% ] 511/600 VUs  4m37.0s/6m00.0s

running (5m03.0s), 513/600 VUs, 39277 complete and 0 interrupted iterations
default   [  77% ] 513/600 VUs  4m38.0s/6m00.0s

running (5m04.0s), 515/600 VUs, 39444 complete and 0 interrupted iterations
default   [  78% ] 515/600 VUs  4m39.0s/6m00.0s

running (5m05.0s), 516/600 VUs, 39625 complete and 0 interrupted iterations
default   [  78% ] 516/600 VUs  4m40.0s/6m00.0s

running (5m06.0s), 518/600 VUs, 39805 complete and 0 interrupted iterations
default   [  78% ] 518/600 VUs  4m41.0s/6m00.0s

running (5m07.0s), 520/600 VUs, 39954 complete and 0 interrupted iterations
default   [  78% ] 520/600 VUs  4m42.0s/6m00.0s

running (5m08.0s), 521/600 VUs, 40102 complete and 0 interrupted iterations
default   [  79% ] 521/600 VUs  4m43.0s/6m00.0s

running (5m09.0s), 523/600 VUs, 40275 complete and 0 interrupted iterations
default   [  79% ] 523/600 VUs  4m44.0s/6m00.0s

running (5m10.0s), 525/600 VUs, 40456 complete and 0 interrupted iterations
default   [  79% ] 525/600 VUs  4m45.0s/6m00.0s

running (5m11.0s), 526/600 VUs, 40582 complete and 0 interrupted iterations
default   [  79% ] 526/600 VUs  4m46.0s/6m00.0s

running (5m12.0s), 528/600 VUs, 40723 complete and 0 interrupted iterations
default   [  80% ] 528/600 VUs  4m47.0s/6m00.0s

running (5m13.0s), 530/600 VUs, 40837 complete and 0 interrupted iterations
default   [  80% ] 530/600 VUs  4m48.0s/6m00.0s

running (5m14.0s), 531/600 VUs, 40979 complete and 0 interrupted iterations
default   [  80% ] 531/600 VUs  4m49.0s/6m00.0s

running (5m15.0s), 533/600 VUs, 41120 complete and 0 interrupted iterations
default   [  81% ] 533/600 VUs  4m50.0s/6m00.0s

running (5m16.0s), 535/600 VUs, 41254 complete and 0 interrupted iterations
default   [  81% ] 535/600 VUs  4m51.0s/6m00.0s

running (5m17.0s), 536/600 VUs, 41390 complete and 0 interrupted iterations
default   [  81% ] 536/600 VUs  4m52.0s/6m00.0s

running (5m18.0s), 538/600 VUs, 41511 complete and 0 interrupted iterations
default   [  81% ] 538/600 VUs  4m53.0s/6m00.0s

running (5m19.0s), 540/600 VUs, 41650 complete and 0 interrupted iterations
default   [  82% ] 540/600 VUs  4m54.0s/6m00.0s

running (5m20.0s), 541/600 VUs, 41837 complete and 0 interrupted iterations
default   [  82% ] 541/600 VUs  4m55.0s/6m00.0s

running (5m21.0s), 543/600 VUs, 41977 complete and 0 interrupted iterations
default   [  82% ] 543/600 VUs  4m56.0s/6m00.0s

running (5m22.0s), 545/600 VUs, 42138 complete and 0 interrupted iterations
default   [  83% ] 545/600 VUs  4m57.0s/6m00.0s

running (5m23.0s), 546/600 VUs, 42314 complete and 0 interrupted iterations
default   [  83% ] 546/600 VUs  4m58.0s/6m00.0s

running (5m24.0s), 548/600 VUs, 42446 complete and 0 interrupted iterations
default   [  83% ] 548/600 VUs  4m59.0s/6m00.0s

running (5m25.0s), 550/600 VUs, 42633 complete and 0 interrupted iterations
default   [  83% ] 550/600 VUs  5m00.0s/6m00.0s

running (5m26.0s), 551/600 VUs, 42801 complete and 0 interrupted iterations
default   [  84% ] 551/600 VUs  5m01.0s/6m00.0s

running (5m27.0s), 553/600 VUs, 42971 complete and 0 interrupted iterations
default   [  84% ] 553/600 VUs  5m02.0s/6m00.0s

running (5m28.0s), 555/600 VUs, 43128 complete and 0 interrupted iterations
default   [  84% ] 555/600 VUs  5m03.0s/6m00.0s

running (5m29.0s), 556/600 VUs, 43244 complete and 0 interrupted iterations
default   [  84% ] 556/600 VUs  5m04.0s/6m00.0s

running (5m30.0s), 558/600 VUs, 43328 complete and 0 interrupted iterations
default   [  85% ] 558/600 VUs  5m05.0s/6m00.0s

running (5m31.0s), 560/600 VUs, 43459 complete and 0 interrupted iterations
default   [  85% ] 560/600 VUs  5m06.0s/6m00.0s

running (5m32.0s), 561/600 VUs, 43597 complete and 0 interrupted iterations
default   [  85% ] 561/600 VUs  5m07.0s/6m00.0s

running (5m33.0s), 563/600 VUs, 43769 complete and 0 interrupted iterations
default   [  86% ] 563/600 VUs  5m08.0s/6m00.0s

running (5m34.0s), 565/600 VUs, 43924 complete and 0 interrupted iterations
default   [  86% ] 565/600 VUs  5m09.0s/6m00.0s

running (5m35.0s), 566/600 VUs, 44080 complete and 0 interrupted iterations
default   [  86% ] 566/600 VUs  5m10.0s/6m00.0s

running (5m36.0s), 568/600 VUs, 44221 complete and 0 interrupted iterations
default   [  86% ] 568/600 VUs  5m11.0s/6m00.0s

running (5m37.0s), 570/600 VUs, 44377 complete and 0 interrupted iterations
default   [  87% ] 570/600 VUs  5m12.0s/6m00.0s

running (5m38.0s), 571/600 VUs, 44534 complete and 0 interrupted iterations
default   [  87% ] 571/600 VUs  5m13.0s/6m00.0s

running (5m39.0s), 573/600 VUs, 44688 complete and 0 interrupted iterations
default   [  87% ] 573/600 VUs  5m14.0s/6m00.0s

running (5m40.0s), 575/600 VUs, 44781 complete and 0 interrupted iterations
default   [  88% ] 575/600 VUs  5m15.0s/6m00.0s

running (5m41.0s), 576/600 VUs, 44872 complete and 0 interrupted iterations
default   [  88% ] 576/600 VUs  5m16.0s/6m00.0s

running (5m42.0s), 578/600 VUs, 44962 complete and 0 interrupted iterations
default   [  88% ] 578/600 VUs  5m17.0s/6m00.0s

running (5m43.0s), 580/600 VUs, 45046 complete and 0 interrupted iterations
default   [  88% ] 580/600 VUs  5m18.0s/6m00.0s

running (5m44.0s), 581/600 VUs, 45138 complete and 0 interrupted iterations
default   [  89% ] 581/600 VUs  5m19.0s/6m00.0s

running (5m45.0s), 583/600 VUs, 45248 complete and 0 interrupted iterations
default   [  89% ] 583/600 VUs  5m20.0s/6m00.0s

running (5m46.0s), 585/600 VUs, 45345 complete and 0 interrupted iterations
default   [  89% ] 585/600 VUs  5m21.0s/6m00.0s

running (5m47.0s), 586/600 VUs, 45448 complete and 0 interrupted iterations
default   [  89% ] 586/600 VUs  5m22.0s/6m00.0s

running (5m48.0s), 588/600 VUs, 45562 complete and 0 interrupted iterations
default   [  90% ] 588/600 VUs  5m23.0s/6m00.0s

running (5m49.0s), 590/600 VUs, 45670 complete and 0 interrupted iterations
default   [  90% ] 590/600 VUs  5m24.0s/6m00.0s

running (5m50.0s), 591/600 VUs, 45804 complete and 0 interrupted iterations
default   [  90% ] 591/600 VUs  5m25.0s/6m00.0s

running (5m51.0s), 593/600 VUs, 45933 complete and 0 interrupted iterations
default   [  91% ] 593/600 VUs  5m26.0s/6m00.0s

running (5m52.0s), 595/600 VUs, 46038 complete and 0 interrupted iterations
default   [  91% ] 595/600 VUs  5m27.0s/6m00.0s

running (5m53.0s), 596/600 VUs, 46156 complete and 0 interrupted iterations
default   [  91% ] 596/600 VUs  5m28.0s/6m00.0s

running (5m54.0s), 598/600 VUs, 46264 complete and 0 interrupted iterations
default   [  91% ] 598/600 VUs  5m29.0s/6m00.0s

running (5m55.0s), 600/600 VUs, 46341 complete and 0 interrupted iterations
default   [  92% ] 600/600 VUs  5m30.0s/6m00.0s

running (5m56.0s), 598/600 VUs, 46418 complete and 0 interrupted iterations
default   [  92% ] 598/600 VUs  5m31.0s/6m00.0s

running (5m57.0s), 596/600 VUs, 46494 complete and 0 interrupted iterations
default   [  92% ] 596/600 VUs  5m32.0s/6m00.0s

running (5m58.0s), 591/600 VUs, 46551 complete and 0 interrupted iterations
default   [  93% ] 591/600 VUs  5m33.0s/6m00.0s

running (5m59.0s), 581/600 VUs, 46641 complete and 0 interrupted iterations
default   [  93% ] 581/600 VUs  5m34.0s/6m00.0s

running (6m00.0s), 568/600 VUs, 46731 complete and 0 interrupted iterations
default   [  93% ] 568/600 VUs  5m35.0s/6m00.0s

running (6m01.0s), 543/600 VUs, 46842 complete and 0 interrupted iterations
default   [  93% ] 543/600 VUs  5m36.0s/6m00.0s

running (6m02.0s), 523/600 VUs, 46958 complete and 0 interrupted iterations
default   [  94% ] 523/600 VUs  5m37.0s/6m00.0s

running (6m03.0s), 508/600 VUs, 47063 complete and 0 interrupted iterations
default   [  94% ] 508/600 VUs  5m38.0s/6m00.0s

running (6m04.0s), 487/600 VUs, 47192 complete and 0 interrupted iterations
default   [  94% ] 487/600 VUs  5m39.0s/6m00.0s

running (6m05.0s), 453/600 VUs, 47316 complete and 0 interrupted iterations
default   [  94% ] 453/600 VUs  5m40.0s/6m00.0s

running (6m06.0s), 432/600 VUs, 47440 complete and 0 interrupted iterations
default   [  95% ] 432/600 VUs  5m41.0s/6m00.0s

running (6m07.0s), 411/600 VUs, 47545 complete and 0 interrupted iterations
default   [  95% ] 411/600 VUs  5m42.0s/6m00.0s

running (6m08.0s), 392/600 VUs, 47653 complete and 0 interrupted iterations
default   [  95% ] 392/600 VUs  5m43.0s/6m00.0s

running (6m09.0s), 365/600 VUs, 47763 complete and 0 interrupted iterations
default   [  96% ] 365/600 VUs  5m44.0s/6m00.0s

running (6m10.0s), 337/600 VUs, 47910 complete and 0 interrupted iterations
default   [  96% ] 337/600 VUs  5m45.0s/6m00.0s

running (6m11.0s), 310/600 VUs, 48058 complete and 0 interrupted iterations
default   [  96% ] 310/600 VUs  5m46.0s/6m00.0s

running (6m12.0s), 283/600 VUs, 48167 complete and 0 interrupted iterations
default   [  96% ] 283/600 VUs  5m47.0s/6m00.0s

running (6m13.0s), 268/600 VUs, 48258 complete and 0 interrupted iterations
default   [  97% ] 268/600 VUs  5m48.0s/6m00.0s

running (6m14.0s), 252/600 VUs, 48365 complete and 0 interrupted iterations
default   [  97% ] 252/600 VUs  5m49.0s/6m00.0s

running (6m15.0s), 226/600 VUs, 48524 complete and 0 interrupted iterations
default   [  97% ] 226/600 VUs  5m50.0s/6m00.0s

running (6m16.0s), 198/600 VUs, 48662 complete and 0 interrupted iterations
default   [  98% ] 198/600 VUs  5m51.0s/6m00.0s

running (6m17.0s), 177/600 VUs, 48832 complete and 0 interrupted iterations
default   [  98% ] 177/600 VUs  5m52.0s/6m00.0s

running (6m18.0s), 155/600 VUs, 48982 complete and 0 interrupted iterations
default   [  98% ] 155/600 VUs  5m53.0s/6m00.0s

running (6m19.0s), 130/600 VUs, 49156 complete and 0 interrupted iterations
default   [  98% ] 130/600 VUs  5m54.0s/6m00.0s

running (6m20.0s), 109/600 VUs, 49293 complete and 0 interrupted iterations
default   [  99% ] 109/600 VUs  5m55.0s/6m00.0s

running (6m21.0s), 089/600 VUs, 49440 complete and 0 interrupted iterations
default   [  99% ] 089/600 VUs  5m56.0s/6m00.0s

running (6m22.0s), 063/600 VUs, 49617 complete and 0 interrupted iterations
default   [  99% ] 063/600 VUs  5m57.0s/6m00.0s

running (6m23.0s), 043/600 VUs, 49791 complete and 0 interrupted iterations
default   [  99% ] 043/600 VUs  5m58.0s/6m00.0s

running (6m24.0s), 021/600 VUs, 49959 complete and 0 interrupted iterations
default   [ 100% ] 021/600 VUs  5m59.0s/6m00.0s

running (6m25.0s), 002/600 VUs, 50060 complete and 0 interrupted iterations
default ↓ [ 100% ] 002/600 VUs  6m0s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=4.73s


  █ TOTAL RESULTS 

    checks_total.......: 50062   130.031594/s
    checks_succeeded...: 100.00% 50062 out of 50062
    checks_failed......: 0.00%   0 out of 50062

    ✓ redirect 302
    ✓ list 200
    ✓ create 201
    ✓ health 200

    CUSTOM
    create_latency.................: avg=3027.512855 min=12.444   med=3253.1015 max=10306.598 p(90)=4250.0237 p(95)=4730.58375
    errors.........................: 0.00%  0 out of 50062
    redirect_latency...............: avg=2980.513572 min=11.097   med=3230.456  max=10207.816 p(90)=4232.4728 p(95)=4747.5322 

    HTTP
    http_req_duration..............: avg=2.91s       min=5.61ms   med=3.21s     max=24s       p(90)=4.22s     p(95)=4.73s     
      { expected_response:true }...: avg=2.91s       min=5.61ms   med=3.21s     max=24s       p(90)=4.22s     p(95)=4.73s     
    http_req_failed................: 0.00%  0 out of 50112
    http_reqs......................: 50112  130.161464/s

    EXECUTION
    iteration_duration.............: avg=3.01s       min=105.81ms med=3.31s     max=10.43s    p(90)=4.32s     p(95)=4.83s     
    iterations.....................: 50062  130.031594/s
    vus............................: 2      min=0          max=600
    vus_max........................: 600    min=600        max=600

    NETWORK
    data_received..................: 28 MB  73 kB/s
    data_sent......................: 4.4 MB 11 kB/s



running (6m25.0s), 000/600 VUs, 50062 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/600 VUs  6m0s